let data = [
    {
        "派别": "全真",
        "场所名称": "北京白云观",
        "地址": "北京市西城区西便门外白云观",
        "负责人姓名": "李信军",
        "省级行政区": "北京",
        "省属地级行政区/直辖市属县区级行政区": "西城区",
        "lon": 116.343781,
        "lat": 39.901235
    },
    {
        "派别": "正一",
        "场所名称": "火德真君庙",
        "地址": "北京市西城区地安门外大街77号",
        "负责人姓名": "张凯",
        "省级行政区": "北京",
        "省属地级行政区/直辖市属县区级行政区": "西城区",
        "lon": 116.395765,
        "lat": 39.936856
    },
    {
        "派别": "全真",
        "场所名称": "吕祖宫",
        "地址": "北京市西城区复兴门北顺城街15号",
        "负责人姓名": "冯高欣",
        "省级行政区": "北京",
        "省属地级行政区/直辖市属县区级行政区": "西城区",
        "lon": 116.357407,
        "lat": 39.912987
    },
    {
        "派别": "正一",
        "场所名称": "东岳庙",
        "地址": "北京市朝阳区朝外大街141号",
        "负责人姓名": "袁志鸿",
        "省级行政区": "北京",
        "省属地级行政区/直辖市属县区级行政区": "朝阳区",
        "lon": 116.4441,
        "lat": 39.925053
    },
    {
        "派别": "全真",
        "场所名称": "桃源观",
        "地址": "北京市海淀区聂各庄镇凤凰岭景区内",
        "负责人姓名": "黄信阳",
        "省级行政区": "北京",
        "省属地级行政区/直辖市属县区级行政区": "海淀区",
        "lon": 116.09018,
        "lat": 40.1023
    },
    {
        "派别": "全真",
        "场所名称": "圣莲山真武庙",
        "地址": "北京市房山区史家营镇圣莲山风景区内",
        "负责人姓名": "高怀仁",
        "省级行政区": "北京",
        "省属地级行政区/直辖市属县区级行政区": "房山区",
        "lon": 115.737848,
        "lat": 39.846455
    },
    {
        "派别": "正一",
        "场所名称": "上英水真武庙",
        "地址": "北京市房山区佛子庄乡上英水村",
        "负责人姓名": "王成亚",
        "省级行政区": "北京",
        "省属地级行政区/直辖市属县区级行政区": "房山区",
        "lon": 115.902492,
        "lat": 39.787952
    }
];

var map = L.map('map').setView([39.901235,116.343781], 16);

L.tileLayer('http://webrd0{s}.is.autonavi.com/appmaptile?lang=zh_cn&size=1&scale=1&style=8&x={x}&y={y}&z={z}',{ 
    subdomains: "1234" 
}).addTo(map);

let temples = L.featureGroup();
data.forEach(function(item) {
    let marker=L.marker([item.lat, item.lon]).bindPopup(item.场所名称)
    temples.addLayer(marker)
})

temples.addTo(map);

map.fitBounds(temples.getBounds());